Итоговый_проект_3_мобильная_версия/src/Documents/Доставка/Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доставка</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоставок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Итоговый_проект_3_мобильная_версия/src/Enums/СтатусыДоставок/СтатусыДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоставок</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>ВзятВРаботу</name>
  </enumValues>
  <enumValues>
    <name>ОтклонёнКурьером</name>
  </enumValues>
  <enumValues>
    <name>ОтклонёнКлиентом</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

Итоговый_проект_3_мобильная_версия/src/Documents/Доставка/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//При выборе статуса «Отклонён курьером» или «Отклонён клиентом» 
	//система должна требовать заполнить комментарий   
	//проверяемые реквизиты - массив - у меня это реквизит Статус и Комментарий
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	//если Статус не отклонен то дабавим в массив непроверяемых реквизитов остальыне статусы и комментарий
	Если Статус = Перечисления.СтатусыДоставок.ВзятВРаботу 
		или Статус = Перечисления.СтатусыДоставок.Выполнен
		или Статус = Перечисления.СтатусыДоставок.Запланирован Тогда  
		НепроверяемыеРеквизиты.Добавить("ВзятВРаботу");
		НепроверяемыеРеквизиты.Добавить("Выполнен");
		НепроверяемыеРеквизиты.Добавить("Запланирован");
		НепроверяемыеРеквизиты.Добавить("Комментарий");
		
		//если статус Отклонен то проверим заполненность поля Комментарий
	ИначеЕсли Не ЗначениеЗаполнено(Комментарий) Тогда
		
		ИндексКомментарий = ПроверяемыеРеквизиты.Найти("Комментарий");
		
		// Если он не заполнен, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните поле комментарий";
		Сообщение.Поле = "Комментарий";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		
		Сообщение.Сообщить();
		
		// Сообщим платформе, что мы сами обработали проверку заполнения реквизита "Комментарий"
		ПроверяемыеРеквизиты.Удалить(ИндексКомментарий);
		
		// Так как информация не консистентна, то продолжать работу дальше смысла нет
		
		Отказ = Истина;
		
	КонецЕсли;

	//вызвать процедуру для удаления непроверяемых реквизитов
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);  
	
КонецПроцедуры;

#Если МобильноеПриложениеКлиент Тогда
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// реализовать регистрацию документов «Доставка» при записи
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = " ВЫБРАТЬ
	                |	ОбменСМобильнымПриложением.Ссылка КАК Ссылка
	                |ИЗ
	                |	ПланОбмена.ОбменСМобильнымПриложением КАК ОбменСМобильнымПриложением
	                |ГДЕ
	                |	НЕ ОбменСМобильнымПриложением.ПометкаУдаления"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	
КонецПроцедуры
#КонецЕсли
